jeremykenedy/PandaVentOS/firmware/sdkconfig.defaults
# Classic ESP32 (Xtensa dual-core LX6), same silicon as the stock module.
CONFIG_IDF_TARGET="esp32"

# 4 MB flash matches stock (esptool image-info on the factory bin).
# Stock runs the part at 80 MHz: the app headers of both BIQU's published
# panda_vent_v1.0.0.bin and the image on the device read freq=80m. Without this
# line the build falls through to the ESP-IDF default of 40m, which is a silent
# divergence from stock on every image we have ever produced.
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Stock-identical OTA partition table.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# The factory UI talks over one WebSocket at /ws.
CONFIG_HTTPD_WS_SUPPORT=y

# Real browsers send >512 B of headers; avoid 431s.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024

# httpd + WS clients + mDNS + MQTT + SSDP share the socket pool.
CONFIG_LWIP_MAX_SOCKETS=16

# Bambu LAN MQTT presents a per-device self-signed cert reached by IP; a LAN
# client must connect without server-cert verification or esp-tls refuses the
# handshake outright. Only affects TLS peers we give no CA (i.e. the printer).
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

# SAFETY: a new image boots on probation. If it does not call
# esp_ota_mark_app_valid_cancel_rollback() the bootloader reverts to the
# previous image by itself. This is what makes a bad flash self-healing
# instead of a cable job.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# A hung task must reboot the device rather than sit there dark.
#
# PANIC is the line that makes that true. Without it a timeout prints one
# line on a UART nobody is watching and the device keeps running hung, which
# is precisely the outcome the sentence above says must not happen -- on a
# headless vent behind a printer there is nothing else to notice it.
# With APP_ROLLBACK_ENABLE above, a hang during probation also ends in a
# rollback to the previous image, which is the self-healing that was wanted.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_PANIC=y

# The Wi-Fi SCAN_DONE handler runs on the esp_event task ("sys_evt"), whose IDF
# default stack is 2304 B. That is tight once the handler also builds JSON and
# queues httpd work, and it overflowed: the device panicked and rebooted on
# every scan, which the setup page showed as "communication interrupted" and
# which made a factory-reset vent impossible to put back on Wi-Fi. The AP
# records are heap-allocated now; this is the second belt.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# The RF calibration blob is not kept in NVS.
#
# Measured 2026-09-03 from a /backup flash image: the nvs partition is 12 KB,
# 378 entries in three pages, and NVS holds one page back for compaction, so
# 252 are usable. The phy namespace took 66 of them, cal_data alone being 61.
# With the Wi-Fi stack's own 86 on top, a complete config (the main blob plus
# six per-state lighting tables) needed 259 and two of the six could never be
# written: every save of them returned ESP_ERR_NVS_NOT_ENOUGH_SPACE and the
# device warned that settings would be lost on restart, which they were.
#
# Turning this off frees the whole phy namespace. The cost is a full RF
# calibration at each boot instead of a cached one; the measurement either
# side of the change is in private/PHASE2-RECORD.md.
CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=n
